# ============================================================
# HAM-ELNet — 4-scale detection (P3/P4/P5/P6)
# Backbone : Conv×5 → C3k2×3 → TransNeXt → SPPF → C2PSA_DAT
# 
# Neck     : FPN (top-down, SE + C3k2_ConvNeXt)
#          + PAN (bottom-up, C3k2_ConvNeXt)
# Head     : 4× Detect  160×160 / 80×80 / 40×40 / 20×20
#
# Tensor notation:  B × C × H × W
# All spatial sizes assume 640×640 input.
# ============================================================

nc: 80          # number of classes
scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

# ============================================================
# BACKBONE
# ============================================================
backbone:
  # ── Stem ──────────────────────────────────────────────────
  - [-1, 1, Conv, [64, 3, 2]]           #  0  Bx3x640x640   → Bx64x320x320
  - [-1, 1, Conv, [128, 3, 2]]          #  1  Bx64x320x320  → Bx128x160x160

  # ── Stage 1  P3  (stride 4) ───────────────────────────────
  - [-1, 1, C3k2, [256, False, 0.25]]   #  2  Bx128x160x160 → Bx256x160x160  [P3]
  - [-1, 1, Conv, [256, 3, 2]]          #  3  Bx256x160x160 → Bx256x80x80

  # ── Stage 2  P4  (stride 8) ───────────────────────────────
  - [-1, 1, C3k2, [512, False, 0.25]]   #  4  Bx256x80x80   → Bx512x80x80    [P4]
  - [-1, 1, Conv, [512, 3, 2]]          #  5  Bx512x80x80   → Bx512x40x40

  # ── Stage 3  P5  (stride 16) ──────────────────────────────
  - [-1, 1, C3k2, [512, True]]          #  6  Bx512x40x40   → Bx512x40x40    [P5]
  - [-1, 1, Conv, [1024, 3, 2]]         #  7  Bx512x40x40   → Bx1024x20x20

  # ── Stage 4  P6  (stride 32) ──────────────────────────────
  - [-1, 1, TransNeXt_Micro, [1024]]    #  8  Bx1024x20x20  → Bx1024x20x20
  - [-1, 1, SPPF, [1024, 5]]            #  9  Bx1024x20x20  → Bx1024x20x20
  - [-1, 1, C2PSA_DAT, [1024]]          # 10  Bx1024x20x20  → Bx1024x20x20   [P6]

# ============================================================
# NECK  (FPN top-down  +  PAN bottom-up)
# ============================================================
neck:
  # ── FPN P6 → P5  (40×40) ──────────────────────────────────
  - [-1,    1, nn.Upsample,      [None, 2, 'nearest']]  # 11  Bx1024x20x20 → Bx1024x40x40
  - [[-1,6],1, Concat,           [1]]                   # 12  (1024+512)   → Bx1536x40x40
  - [-1,    1, C3k2_ConvNeXt,   [512, False]]           # 13  Bx1536x40x40 → Bx512x40x40
  - [-1,    1, SE,               [512]]                 # 14  Bx512x40x40  → Bx512x40x40

  # ── FPN P5 → P4  (80×80) ──────────────────────────────────
  - [-1,    1, nn.Upsample,      [None, 2, 'nearest']]  # 15  Bx512x40x40  → Bx512x80x80
  - [[-1,4],1, Concat,           [1]]                   # 16  (512+512)    → Bx1024x80x80
  - [-1,    1, C3k2_ConvNeXt,   [256, False]]           # 17  Bx1024x80x80 → Bx256x80x80
  - [-1,    1, SE,               [256]]                 # 18  Bx256x80x80  → Bx256x80x80

  # ── FPN P4 → P3  (160×160) ────────────────────────────────
  - [-1,    1, nn.Upsample,      [None, 2, 'nearest']]  # 19  Bx256x80x80  → Bx256x160x160
  - [[-1,2],1, Concat,           [1]]                   # 20  (256+256)    → Bx512x160x160
  - [-1,    1, C3k2_ConvNeXt,   [256, False]]           # 21  Bx512x160x160→ Bx256x160x160  → Detect P3

  # ── PAN P3 → P4  (80×80) ──────────────────────────────────
  - [-1,    1, SE,               [256]]                 # 22  Bx256x160x160→ Bx256x160x160
  - [-1,    1, Conv,             [256, 3, 2]]           # 23  Bx256x160x160→ Bx256x80x80
  - [[-1,18],1, Concat,          [1]]                   # 24  (256+256)    → Bx512x80x80
  - [-1,    1, C3k2_ConvNeXt,   [512, False]]           # 25  Bx512x80x80  → Bx512x80x80    → Detect P4

  # ── PAN P4 → P5  (40×40) ──────────────────────────────────
  - [-1,    1, Conv,             [512, 3, 2]]           # 26  Bx512x80x80  → Bx512x40x40
  - [[-1,14],1, Concat,          [1]]                   # 27  (512+512)    → Bx1024x40x40
  - [-1,    1, C3k2_ConvNeXt,   [1024, False]]          # 28  Bx1024x40x40 → Bx1024x40x40   → Detect P5

  # ── PAN P5 → P6  (20×20) ──────────────────────────────────
  - [-1,    1, Conv,             [1024, 3, 2]]          # 29  Bx1024x40x40 → Bx1024x20x20
  - [[-1,10],1, Concat,          [1]]                   # 30  (1024+1024)  → Bx2048x20x20
  - [-1,    1, C3k2_ConvNeXt,   [1024, True]]           # 31  Bx2048x20x20 → Bx1024x20x20   → Detect P6

# ============================================================
# HEAD
# ============================================================
head:
  - [[21, 25, 28, 31], 1, Detect, [nc]]
  #   21 → P3  Bx256x160x160   stride  4   tiny defects
  #   25 → P4  Bx512x80x80      stride  8   small defects
  #   28 → P5  Bx1024x40x40    stride 16   medium-to-large defects
  #   31 → P6  Bx1024x20x20    stride 32  extra-large defects
# ============================================================
# CHANNEL FLOW   (640×640 input)
# ============================================================
# idx  Module                    in-ch    out-ch   H×W
# ──────────────────────────────────────────────────────────
# Backbone
#  0   Conv[64,3,2]                  3       64   320×320
#  1   Conv[128,3,2]                64      128   160×160
#  2   C3k2[256,F,0.25]            128      256   160×160  ← P3
#  3   Conv[256,3,2]               256      256    80×80
#  4   C3k2[512,F,0.25]            256      512    80×80   ← P4
#  5   Conv[512,3,2]               512      512    40×40
#  6   C3k2[512,T]                 512      512    40×40   ← P5
#  7   Conv[1024,3,2]              512     1024    20×20
#  8   TransNeXt_Micro[1024]      1024     1024    20×20
#  9   SPPF[1024,5]               1024     1024    20×20
# 10   C2PSA_DAT[1024]            1024     1024    20×20   ← P6
#
# FPN (top-down)
# 11   Upsample(#10)              1024     1024    40×40
# 12   Concat(#11, #6)       1024+512     1536    40×40
# 13   C3k2_ConvNeXt[512,F]       1536      512    40×40
# 14   SE[512]                     512      512    40×40
# 15   Upsample(#14)               512      512    80×80
# 16   Concat(#15, #4)         512+512     1024    80×80
# 17   C3k2_ConvNeXt[256,F]       1024      256    80×80
# 18   SE[256]                     256      256    80×80
# 19   Upsample(#18)               256      256   160×160
# 20   Concat(#19, #2)         256+256      512   160×160
# 21   C3k2_ConvNeXt[256,F]        512      256   160×160  → Detect P3
#
# PAN (bottom-up)
# 22   SE[256]   (#21)             256      256   160×160
# 23   Conv[256,3,2]               256      256    80×80
# 24   Concat(#23, #18)        256+256      512    80×80
# 25   C3k2_ConvNeXt[512,F]        512      512    80×80   → Detect P4
# 26   Conv[512,3,2]               512      512    40×40
# 27   Concat(#26, #14)        512+512     1024    40×40
# 28   C3k2_ConvNeXt[1024,F]      1024     1024    40×40   → Detect P5
# 29   Conv[1024,3,2]             1024     1024    20×20
# 30   Concat(#29, #10)      1024+1024     2048    20×20
# 31   C3k2_ConvNeXt[1024,T]      2048     1024    20×20   → Detect P6
